// 1. Есть массив в котором лежат объекты с датами, отсортировать по датам.
// результат вывести в консоль
// let array = [{date: '10.01.2017'}, {date: '05.11.2016'}, {date: '21.13.2002'}];

//2. Как быстрее всего найти сумму элементов массива? Написать решение

// 3. Нужно определить, является ли слово или любая из перестановок его букв — палиндромом.
// Примеры строк: radar, madam, bar, civic,
// radar — является палиндромом
// madam — тоже палиндром
// bar — не палиндром
// civic — палиндром
// vicic — палиндром, т.к. это одна из возможных перестановок для слова civic
// toot и toto так же будут возвращать true

// 4. Реализовать функцию f: f(2, 3) -> 5, при вызове f(2)(3), тоже вернет 5
// тестовый вариант: f(1)(2)(3)() -> 6, f(0)(3)(1)(5)() -> 8, foo(1)(2)(3) -> 6

// 5. Сортировка пузырьком

// 6. Напишите код, который сделает из массива объект
//на входе массив
// [
//     {name: 'width', value: 10},
//     {name: 'height', value: 20}
// ]
// на выходе объект
// { width: 10, height: 20 }

// 7. Уникализация значений в массиве.
// functionName([1, 1, 2, 2, 4, 2, 3, 7, 3]); // => [1, 2, 4, 3, 7]

// 8. «Расплющивание» массива.
// functionName([1, [2, [3, [4,5]]]]); // => [1, 2, 3, 4, 5]
// functionName([1, [2, [3, [4,[5]]]]]); // => [1, 2, 3, 4, 5]

// 9. Найдете в файле https://raw.githubusercontent.com/kuzmenkovaES/test-Git/main/Promises_HW1.html

//10. Сумма вершин дерева из задачи 9
